int main() {

    char c = '1';    // символ

    bool b = true;   // логическая переменная, принимает значения false и true

    int i = 42;      // целое число (занимает, как правило, 4 байта)

    short int i = 17;            // короткое целое (занимает 2 байта)

    long li = 12321321312;       // длинное целое (как правило, 8 байт)

    long long lli = 12321321312; // длинное целое (как правило, 8 байт)

    float f = 2.71828;           // дробное число с плавающей запятой (4 байта)

    double d = 3.141592;         // дробное число двойной точности (8 байт)

    long double ld = 1e15;       // длинное дробное (как правило, 16 байт)

}
